# проверка, что пользователь ввел число
try:
    a = int(input('Введите длину первой стороны треугольника: '))
    b = int(input('Введите длину второй стороны треугольника: '))
    c = int(input('Введите длину третьей стороны треугольника: '))
except TypeError:
    raise TypeError('Нужно ввести число')

# проверка, что длина сторон больше 0
if a <= 0 or b <= 0 or c <= 0:
    raise ValueError('Длина стороны должна быть больше 0')

if (a + b <= c) or (a + c <= b) or (b + c <= a):
    print('Такого треугольника не существует')
elif a == b == c:
    print('Это равносторонний треугольник')
elif a == b or a == c or b == c:
    print('Это равнобедренный треугольник')
else:
    print('Это разносторонний треугольник')
